import { Text, ScrollView } from 'react-native'
import { SafeAreaView } from 'react-native-safe-area-context'

const TermsOfUseScreen = () => {
  return (
    <SafeAreaView className="flex-1">
      <ScrollView className="flex-1 px-number-8">
        <Text className="pb-number-13 pt-number-3 text-black label-xxs">
          제 1조 (목적) {`\n`}본 약관은 회사가 제공하는 교대 근무자 루틴관리
          서비스의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임 사항,
          기타 필요한 사항을 규정함을 목적으로 나타냅니다. {`\n`}
          {`\n`}제 2조 (용어의 정의) {`\n`} 1. ‘서비스’라 함은 교대 근무자의
          특정을 고료한 루틴 관리, 스케줄 관리, 건강 관리 정보 제공, 팀 기능을
          포함하여 회사가 모바일 애플리케이션을 통해 제공하는 모든 관련 제반
          서비스를 의미합니다. {`\n`} 2. ‘회원’이라 함은 본 약관에 따라 회사와
          이용 계약을 체결하고 회사가 제공하는 서비스를 이용하는 자를
          의미합니다. {`\n`} 3. ‘계정’이라 함은 회원이 서비스에 게시하거나
          서비스를 통해 주고 받는 부호, 문자, 음성, 음향, 화상, 동영상 등의 정보
          형태으 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다. {`\n`}
          {`\n`}제 3조 (약관의 게시와 개정) {`\n`} 1. 회사는 본 약관의 내용을
          회원이 쉽게 알 수 있도록 서비스 내 또는 연결화면에 게시합니다. {`\n`}{' '}
          2. 회사는 ‘약관의 규제에 관한 법률’, ‘정보통신망 이용 촉진 및
          정보보호등에 관한 법률’ 등 관련 법령을 위배하지 않는 범위에서 본
          약관을 개정할 수 있습니다. {`\n`} 3. 회사가 약관을 개정하는 경우, 적용
          일자 및 개정 사유를 명시하여 현행 약관과 함께 제 1항의 방식에 따라 그
          개정약관의 적용일자 7일 전부터 적용 일자 전일까지 공지합니다. 다만,
          회원에게 불리한 약관 개정의 경우 적용일자 30일 전에 공지하며, 이메일,
          서비스 내 알림들의 전자적 수단을 통해 별도로 통지할 수 있습니다.{' '}
          {`\n`} 4. 회사의 전항에 따라 개정 약관을 공지 또는 통지하면서 회원에게
          일정 기간 내 의사표시를 하지 않으면 의사 표시가 표명된 것으로 본다는
          뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의
          의사표시를 하지 아니한 경우, 회원이 개정약관에 동의한 것으로 봅니다.{' '}
          {`\n`} 5. 회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정
          약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수
          있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사유가 있는 경우
          회사는 이용계약을 해지할 수 있습니다. {`\n`}
          {`\n`}제 4조 (이용계약 체결) {`\n`} 1. 이용계약은 회원이 되고자
          하는자가 약관의 내용에 대하여 동의를 한 다음 회원가입 신청이
          승낙됨으로 체결됩니다. {`\n`} 2. 회사는 가입 신청자에 대하여 서비스
          이용을 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각 호에 해당하는
          신청에 대하여는 승낙하지 않거나 이용계약을 해지할 수 있습니다. {`\n`}{' '}
          {'\u00A0'} a. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한
          적이 있는 경우. 단, 회사의 회원 재가입 승낙을 얻은 경우에는 예외로 함.{' '}
          {`\n`} {'\u00A0'} b. 실명이 아니거나 타인의 명의를 이용한 경우 {`\n`}{' '}
          {'\u00A0'} c. 허위의 정보를 기재하거나, 회사가 제시하는 내용을
          기재하지 않은 경우 {`\n`} {'\u00A0'} d. 만 19세 미만 청소년이
          법정대리인의 동의를 얻지 아니한 경우
          {`\n`} {'\u00A0'} e. 이용자의 귀책사유로 인하여 승인이 불가능하거나
          기타 규정한 제반 사항을 위반하며 신청하는 경우 {`\n`} 3. 제1항에 따른
          신청에 있어 회사는 회원의 종류에 따라 전문기관을 통한 실명확인 및
          본인인증을 요청할 수 있습니다. {`\n`} 4. 회사는 서비스 관련 설비의
          여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할
          수 있습니다.
          {`\n`} 5. 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나
          유보한 경우, 회사는 원칙적으로 이를 가입신청자에게 알리도록 합니다.{' '}
          {`\n`} 6. 이용계약의 성립 시기는 회사가 가입완료를 신청절차 상에서
          표시한 시점으로 합니다. {`\n`}
          {`\n`}제 5조 (회원 정보의 변경) {`\n`} 1. 회원은 개인정보관리화면을
          통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만,
          서비스 관리를 위해 필요한 실명, 아이디 등은 수정이 불가능할 수
          있습니다. {`\n`} 2. 회원은 회원가입신청 시 기재한 사항이 변경되었을
          경우 온라인으로 수정을 하거나 전자우편 기타 방법으로 회사에 대하여 그
          변경사항을 알려야 합니다. {`\n`} 3. 제2항의 변경사항을 회사에 알리지
          않아 발생한 불이익에 대하여 회사는 책임지지 않습니다. {`\n`}
          {`\n`}제 6조 (개인정보보호 의무) {`\n`}회사는 ‘정보통신망법’,
          ‘개인정보보호법’ 등 관계 법령이 정하는 바에 따라 회원의 개인정보를
          보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련 법령
          및 회사의 개인정보처리방침이 적용됩니다. 다만, 회사의 공식 사이트
          이외의 링크된 사이트에서는 회사의 개인정보처리방침이 적용되지
          않습니다. {`\n`}
          {`\n`}제 7조 (회원의 아이디 및 비밀번호의 관리에 대한 의무) {`\n`} 1.
          회원의 아이디와 비밀번호에 관한 관리 택임은 회원에게 있으며, 이를 제
          3자가 이용하도록 하여서는 아니됩니다.
          {`\n`} 2. 회사는 회원의 아이디가 개인정보 유출의 우려가 있거나,
          반사회적이거나 미풍양속에 어긋나거나 회사 및 회사의 운영자로 오인할
          우려가 있는 경우, 해당 아이디의 이용을 제한할 수 있습니다.
          {`\n`} 3. 회원은 아이디 및 비밀번호가 도용되거나 제 3자가 사용하고
          있음을 인지한 경우, 이를 즉시 회사에 통지하고 회사의 안내에
          따라야합니다. {`\n`} 4. 제 3항의 경우 해당 회원이 회사에 그 사실을
          통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한
          불이익에 대하여는 회사는 책임지지 않습니다. {`\n`}
          {`\n`}제 8조 (회원에 대한 통지) {`\n`} 1. 회사가 회원에 대한 통지를
          하는 경우, 이 약관에 별도 규정이 없는 한 회원이 지정한 이메일 주소,
          서비스 내 알림 등으로 통지 할 수 있습니다.
          {`\n`} 2. 회사는 회원 전체에 대한 통지의 경우, 7일 이상 서비스의
          공지사항에 게시함으로써 제 1항의 통지에 갈음할 수 있습니다. 다만, 회원
          본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여 개별
          통지합니다. {`\n`}
          {`\n`}제 9조 (회사의 의무) {`\n`} 1. 회사는 관련 법령과 본 약관이
          금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로
          서비스를 제공하기 위해 최선을 다해 노력합니다.
          {`\n`} 2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록
          개인정보보호를 위한 보안 시스템을 갖추며, 개인정보처리방침을 공시하고
          준수합니다. {`\n`} 3. 회사는 서비스 이용과 관련하여 회원으로부터
          제기된 의견이나 불만이 정당하다고 인정할 경우, 이를 처리해야합니다.
          회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 이메일
          등을 통하여 회원에게 처리과정 및 결과를 전달합니다. {`\n`}
          {`\n`}제 10조 (회원의 의무) {`\n`} 1. 회원은 다음 행위를 해서는
          아니됩니다. {`\n`}
          {'\u00A0'}
          {'\u00A0'} a. 신청 또는 변경 시 허위 내용의 등록 {`\n`}
          {'\u00A0'}
          {'\u00A0'} b. 타인의 정보도용 {`\n`}
          {'\u00A0'}
          {'\u00A0'} c. 회사가 게시한 내용의 정보 변경 {`\n`}
          {'\u00A0'}
          {'\u00A0'} d. 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의
          송신 또는 게시 {`\n`}
          {'\u00A0'}
          {'\u00A0'} e. 회사와 기타 제3자의 저작권 등 지적 재산권에 대한 침해{' '}
          {`\n`}
          {'\u00A0'}
          {'\u00A0'} f. 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는
          행위 {`\n`}
          {'\u00A0'}
          {'\u00A0'} g. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에
          반하는 정보를 서비스에 공개 또는 게시하는 행위 {`\n`}
          {'\u00A0'}
          {'\u00A0'} h. 회사의 동의 없이 영리를 목적으로 서비스를 이용하는 행위{' '}
          {`\n`}
          {'\u00A0'}
          {'\u00A0'} i. 기타 불법적이거나 부당한 행위 {`\n`} 2. 회원은 관계
          법령, 본 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항,
          회사가 통지하는 사항 등을 준수해야 하며, 기타 회사 업무에 방해되는
          행위를 하여서는 아니됩니다. {`\n`}
          {`\n`}제 11조 (서비스의 제공 등) {`\n`} 1. 회사는 회원에게 아래와 같은
          서비스를 제공합니다. {`\n`}
          {'\u00A0'}
          {'\u00A0'} a. 교대 근무 패턴 기반 자동 루틴 설정 {`\n`}
          {'\u00A0'}
          {'\u00A0'} b. 홈 루틴 대시보드 {`\n`}
          {'\u00A0'}
          {'\u00A0'} c. 자동 알림 기능 {`\n`}
          {'\u00A0'}
          {'\u00A0'} d. 상태 기반 루틴 카드 {`\n`}
          {'\u00A0'}
          {'\u00A0'} e. 수면 케어 및 식사 및 공복 관리 기능 {`\n`}
          {'\u00A0'}
          {'\u00A0'} f. 걸음 수 리포트 제공 {`\n`}
          {'\u00A0'}
          {'\u00A0'} g. 근무 캘린더 기능 (일정 확인, 메모 추가, 친구 캘린더
          공유, 근무) {`\n`}
          {'\u00A0'}
          {'\u00A0'} h. 기타 회사가 추가 개발하거나 다른 회사와 제휴 계약 등을
          통해 회원에게 제공하는 일체의 서비스 {`\n`} 2. 서비스는 연중무휴, 1일
          24시간 제공함을 원칙으로 합니다.
          {`\n`} 3. 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신
          두절 또는 운영상 상당한 이유가 있는 경우, 서비스의 제공을 일시적으로
          중단할 수 있습니다. 이경우 회사는 제 8조(회원에 대한 통지)에 정한
          방법으로 회원에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는
          부득이한 사유가 있는 경우, 사후에 통지할 수 있습니다. {`\n`} 4. 회사는
          서비스의 제공에 필요한 경우, 정기 점검을 실시할 수 있으며, 정기 점검
          시간은 서비스 제공화면에 공지한 바에 따릅니다. {`\n`}
          {`\n`}제 12조 (서비스의 변경) {`\n`} 1. 회사는 상당한 이유가 있는
          경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부
          서비스를 변경할 수 있습니다. {`\n`} 2. 서비스의 내용, 이용방법,
          이용시간에 대하여 변경이 있는 경우, 변경 사유, 변경될 서비스의 내용 및
          제공일자 등은 그 변경 전에 해당 서비스 초기화면에 게시해야합니다.{' '}
          {`\n`} 3. 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책
          및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련 법령에
          특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다. {`\n`}
          {`\n`}제 13조 (정보의 제공 및 광고의 게재) {`\n`} 1. 회사는 회원이
          서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 이메일,
          서비스 내 알림 등의 방법으로 회원에게 제공할 수 있습니다. 다만, 회원은
          관련 법령에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을
          제외하고는 언제든지 수신 거절을 할 수 있습니다. {`\n`} 2. 회사는
          서비스의 운영과 관련하여 서비스 화면, 홈페이지, 이메일 등에 광고를
          게재할 수 있습니다. 광고가 게재된 이메일 등을 수신한 회원은 수신거절을
          회사에게 할 수 있습니다. {`\n`}
          {`\n`}제 14조 (게시물의 저작권) {`\n`} 1. 회원이 서비스 내에 게시한
          콘텐츠의 저작권은 해당 게시물의 저작자에게 귀속됩니다. {`\n`} 2.
          회원이 서비스 내에 게시하는 콘텐츠는 검색결과 내지 서비스 및 관련
          프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는
          일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 회사는 저작권법
          규정을 준수하며, 회원은 언제든지 고객센터 또는 서비스 내 관리기능을
          통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 취할
          수 있습니다. {`\n`} 3. 회사는 제2항 이외의 방법으로 회원의 게시물을
          이용하고자 하는 경우에는 전화, 팩스, 이메일 등을 통해 사전에 회원의
          동의를 얻어야 합니다. {`\n`}
          {`\n`}제 15조 (게시물의 관리) {`\n`} 1. 회원의 콘텐츠가 "정보통신망법"
          및 "저작권법"등 관련 법령에 위반되는 내용을 포함하는 경우, 권리자는
          관련 법령이 정한 절차에 따라 해당 콘텐츠의 게시중단 및 삭제 등을
          요청할 수 있으며, 회사는 관련 법령에 따라 조치를 취하여야 합니다.{' '}
          {`\n`} 2. 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가
          인정될 만한 사유가 있거나 기타 회사 정책 및 관련 법령에 위반되는
          경우에는 관련 법령에 따라 해당 콘텐츠에 대해 임시조치 등을 취할 수
          있습니다. {`\n`}
          {`\n`} 제 16조 (권리의 귀속) {`\n`} 1. 서비스에 대한 저작권 및
          지식재산권은 회사에 귀속됩니다. 단, 회원의 콘텐츠 및 제휴계약에 따라
          제공된 저작물 등은 제외합니다. {`\n`} 2. 회사는 서비스와 관련하여
          회원에게 회사가 정한 이용조건에 따라 계정, 아이디, 콘텐츠 등을 이용할
          수 있는 이용권만을 부여하며, 회원은 이를 양도, 판매, 담보제공 등의
          처분행위를 할 수 없습니다. {`\n`}
          {`\n`}제 17조 (계약 해제, 해지 등) {`\n`} 1. 회원은 언제든지 서비스 내
          계정 삭제 화면을 통하여 이용계약 해지 신청을 할 수 있으며, 회사는 관련
          법령 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다. {`\n`} 2.
          회원이 계약을 해지할 경우, 관련 법령 및 개인정보처리방침에 따라 회사가
          회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는
          소멸됩니다. {`\n`} 3. 회원이 계약을 해지하는 경우, 회원이 작성한
          게시물 중 본인 계정에 등록된 게시물 일체는 삭제됩니다. 다만, 타인에
          의해 담기, 스크랩 등이 되어 재게시되거나, 공용게시판에 등록된 게시물
          등은 삭제되지 않을 수 있으니 사전에 삭제 후 탈퇴하시기 바랍니다.{' '}
          {`\n`}
          {`\n`}제 18조 (이용제한 등) {`\n`} 1. 회사는 회원이 본 약관의 의무를
          위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시 정지, 영구
          이용 정지 등으로 서비스 이용을 단계적으로 제한할 수 있습니다. {`\n`}{' '}
          2. 회사는 전항에도 불구하고, ‘주민등록법’을 위반한 명의 도용 및 결제
          도용, ‘저작권법’ 을 위반한 불법 프로그램의 제공 및 운영방해,
          ‘정보통신망법’을 위반한 불법통신 및 해킹, 악성프로그램의 배포,
          접속권한 초과행위 등과 같이 관련 법령을 위반한 경우에는 즉시
          영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 서비스
          이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로
          보상하지 않습니다. {`\n`} 3. 회사는 본 조에 따라 서비스 이용을
          제한하거나 계약을 해지하는 경우 제 8조(회원에 대한 통지)에 따라
          통지합니다. {`\n`} 4. 회원은 본 조에 따른 이용제한 등에 대해 회사가
          정한 정차에 따라 이의신청을 할 수 있습니다. 이때 이의가 정당하다고
          회사가 인정하는 경우, 회사는 즉시 서비스의 이용을 재개합니다. {`\n`}
          {`\n`}제 19조 (책임 제한) {`\n`} 1. 회사는 천재지변 또는 이에 준하는
          불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에
          관한 책임이 면제됩니다. {`\n`} 2. 회사는 회원의 귀책사유로 인한 서비스
          이용의 장애에 대하여는 책임을 지지 않습니다. {`\n`} 3. 회사는 회원이
          서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에
          관하여는 책임을 지지 않습니다. {`\n`} 4. 회사는 회원 간 또는 회원과
          제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 책임이
          면제됩니다. {`\n`} 5. 회사는 무료로 제공되는 서비스 이용과 관련하여
          관련 법령에 특별한 규정이 없는 한 책임을 지지 않습니다. {`\n`} 6. 본
          서비스가 제공하는 건강 관련 정보(수면, 식사, 스트레칭, 감정 상태 분석
          등)는 일반적인 건강 증진 및 생활 습관 개선을 위한 참고자료이며,
          의학적인 진단이나 처방을 대체할 수 없습니다. 회원은 건강 상태에 대한
          전문적인 판단이 필요한 경우 반드시 의사 등 전문가와 상담해야 하며,
          회사는 본 서비스에서 제공된 정보로 인해 발생한 어떠한 결과에 대해서도
          책임을 지지 않습니다. {`\n`} 7. 본 서비스의 팀 기능(대타 근무자 구인,
          인수인계 등)은 회원 간의 자율적인 의사소통을 보조하는 수단이며, 회사는
          이를 통해 발생되는 회원 간의 약속, 거래, 의무 이행 등에 대해 어떠한
          책임도 부담하지 않습니다. {`\n`}
          {`\n`}제 20조 (준거법 및 재판 관할)
          {`\n`} 1. 회사와 회원 간 제기된 소송은 대한민국 법을 준거법으로
          합니다. {`\n`} 2. 회사와 회원 간 발생한 분쟁에 관한 소송은
          민사소송법상 관할 법원에 제소합니다. {`\n`}
          {`\n`}부칙 {`\n`}본약관은 [런칭일] 부터 적용됩니다.
        </Text>
      </ScrollView>
    </SafeAreaView>
  )
}

export default TermsOfUseScreen
